{"files": [{"category": "reflection", "path": "05162023.md", "date": "05/16/2023", "data": "# Utilitarian Ethics\nBentham: utility, pleasure pain, \nMills: levels of pleasure, happiness > utility -> less deterministic so free will\nMills is better but its still really sus cuz like hi i'm hitler and im gonna kill the jews cuz the happiness i will recieve >> than the happiness of all the jews. but hitler how do u know u'll be happy? cause i said so you idiot now fly the plane. "}, {"category": "daily", "path": "04202023.md", "date": "04/20/2023", "data": "# Masculinity and Femininity\nGiven the controversial nature of this week's topics, I'm going to opt for talking about gendered language and it's relationship with masculinity / femininity. You see, in Spanish, words like \"book\" and \"work\" are conjugated in the \"masculine form\" as \"el libro\" and \"el trabajo\". On the other hand, words like \"kitchen\" and \"mop\" are conjugated in the \"femininie form\" as \"la cocina\" and \"la fregona\". Of course, there are exceptions, but I find it interesting that the Spanish language itself evolved to embrace the stereotypes of masculinity and femininity. In recent years, I've heard that there's a debate on introducing new pronouns / conjugations in spanish ending in -e. But, if anything, I think the evolution of gendered languages suggest that the definitions of masculinity and femininity are societal and not inherent to the particular sex. And in that regard, it gives us hope. If we change society's view of masculinity and femininity, perhaps words can change too. \n"}, {"category": "daily", "path": "04182023.md", "date": "04/18/2023", "data": "# Future News\nIf the reproducibility crisis in academic research was solved, I'd imagine a newspaper title would be something like \"Breaking News: Scientists Have Stopped Lying!\" But a more serious (just kidding) note:\n\"Scientific Triumph: Research is Now Reputable\"\n\"Cite Your Sources Because Now They're Accurate\"\n\"ATTENTION: Academia is No Longer a Scam!\"\n"}, {"category": "daily", "path": "03212023.md", "date": "03/21/2023", "data": "# First Thought\n*Imagine that you had to make an immediate decision. What is the first thing that comes to your head without thinking?*\n\nWhile I hate to admit it, I usually survey what those around me, specifically those I respect, are doing. I quickly exhaust a list of pros and cons, trying to aniticipate consequences. But if time is limited, as it usually is, I just do what feels right. How do I know what feels right? Your guess is as good as mine.\n"}, {"category": "daily", "path": "03142023.md", "date": "03/14/2023", "data": "# Bruteforcing a Solution\nRegarding the reproducibility problem described in my previous entries:\n1. Journals within a certain quartile or impact factor should be required to verify authors. Randomly selected volunteers must reproduce the work to the best degree and provide feedback.\n2. Make humans moral...\n3. Force all papers to publish code repositories, using open-source licenses to appropriately protect the rights to their work.\n4. Build an automated, ML-based solution for checking piracy or reproducibility. This already exists to some extent, but we could make one that actually works.\n5. Fine violators heavily and revoke their positions of authority.\n6. Make journals free, and replace impact factor systems with stars or upvote/downvote. Then, the reproducibility problem won't exist because those papers won't get rated well. The papers that are truly good and reproducible if feasible will be rated higher.\n7. Just don't write papers. \n\nI hope you enjoyed my very profound problem solving process.\n"}, {"category": "reflection", "path": "03132023.md", "date": "03/13/2023", "data": "# Invulnerability Pill\nI just wanted to take a moment to reflect on the concept of stoicism and emotional vulnerability. In class today, we read an excerpt from Todd May's \"Invulnerability Pill,\" so let's talk about invulnerability.\n\nI think the prevailing thought in modern society is that everyone should be emotionally vulnerable. Vulnerability should be cherished, and concepts like toxic masculinity are, as the name suggests, toxic. Yes, I understand that males in our modern society are taught to hide their emotions: \"boy's don't cry\" after all. But, I don't think that this is necessarily a reflection of society itself. Personally, I don't feel comfortable crying in front of others, and if that's just me being a \"toxic male\" then so be it. \n\nShould everyone be forced to be emotionally vulnerable? No. Should everyone be taught to be invulnerable? Of course not. I think vulnerability is really just a reflection of personality, and I don't find particular value in denying the value of one over the other. Just because I don't cry in front of others doesn't mean that I don't have emotions or am vulnerable. If I find it fitting to discuss it, I discuss it. I choose when to be vulnerable, and I enjoy being able to make that decision instead of being a sobbing mess every month. In some sense, for me, I consider it maturity: being able to be vulnerable or invulnerable. \n\nAnd perhaps choosing to always be invulnerable or vulnerable is philosophical suicide itself! By choosing to be permenantely emotionally vulnerable, a person subjects themselves to the power of their emotions, rejecting thought and simply guiding themselves to navigate the fragility of emotional vulnerability. At the same time, the stoic subjects themselves to a 3rd person role, depriving them of experience and subjecting them to a permanent outlook. Being able to choose between the two is not only mature, in my opinion, but it shows a Sisyphus-like resistance to suicide. Yes, we can just let the rock roll, at the will of our emotions. Yes, we can be persistent, pushing the rock forward, and stopping at the top. But, by subsisting, managing both vulnerability and invulnerability, we are, in my opinion, mature and \"thinking\".\n"}, {"category": "reflection", "path": "03062023.md", "date": "03/06/2023", "data": "# Plato's Allegory of the Cave\n1: What is your reality?\n\nI am a Christian, a researcher, and developer. As a student of TJHSST, I am constantly immersed in a competitive academic atmosphere, and at church, I am continually exposed to radically conservative ideas, despite my agreement/disagreement with them. I have been taught to question, argue, and think for myself, but I place a great value on individual achievement. \n\n2: What would it take to be dragged and compelled out of the cave? \n\nIn order to fully exit this conservative upbringing, I would need to be completely immersed in a radically different atmosphere, whether that happen at college or in the workplace. But to be frank, I'm not sure that it's possible for me to completely adjust to the light of the sun. One issue I have with Plato's allegory is the assumption that the prisoner's sight is bound to adjust. I agree that my sight will adjust, but I don't think I will be able to fully immerse myself in a different perspective. \n\n"}, {"category": "daily", "path": "02282023.md", "date": "02/28/2023", "data": "# Extremify?\nRegarding the reproducibility problem described in my previous entry:\n\nLet's consider an extreme solution. All work must be replicated before publication by more than three independent researchers. Tables and metrics must be exactly verified, and all implementation instructions or code must be provided by the paper. Besides the additional effort on the part of the journal to carry out this procedure, by the end, the reviewer has done nearly as much work as the primary investigator. Further, for large projects with multiple authors, it is nearly impossible to task one person on replicating the entire paper. While the solution solves the reproducibility crisis, the burden on the reviewer is too large to surmount. \n\nOn the other hand, let's consider an extreme version of the problem. What if the researcher directly made up information? Could this go undetected? At the moment, there is no such reproducibility verification, so hypothetically, a researcher could get away with making up entire tables of data. \n\nConsidering these extremes, it seems like the best overall solution is for journals to require code to be shared along with published work. This guarantees some amount of reproducibility as reviewers should be able to immediately run code and see results, but at the same time, it does not force all reviewers to spend exorbitant amounts of time for verification.\n\n"}, {"category": "daily", "path": "02232023.md", "date": "02/23/2023", "data": "# Challenge: Be A Skeptic\nRegarding the reproducibility problem described in my previous entry:\n\nBut, how do we know that the reproducibility crisis even exists? Perhaps the real issue is that academic papers need a more thorough format. Before preemptively blaming academic dishonesty, maybe the stigma of verbose research writing dilutes the implementation details that are needed to increase reproducibility. \n\nHow is this a pertinent issue for the larger academic audience? If a journal wants to publish quality work, they are free to mandate peer-review or reproducibility rules. However, if no such rules are in place, why is it the responsibility of the researcher to produce reproducible work if that is not the requirement?\n\nOf course, as with any academic pursuit, dishonest people exist, but it is entirely inappropriate to call this matter a crisis, or even an issue.\n"}, {"category": "daily", "path": "02092023.md", "date": "02/09/2023", "data": "# Explain It to An Alien\n**Problem:** How do we solve the reproducibility crisis in academic research, specifically in computer science?\n\nDear Alien,\n\nImagine you make a discovery. You find a rock. The rock is shiny, heavy, and glows in the dark. So what do you do? You tell your friends, of course. You tell them that you saw a rock. It was shiny, heavy, and glowed in the dark. Your friends ask to see the rock, and that's when you realize that you dropped it on your way to see them. Should you be trusted? How do your friends know that you never lied?\n\nThis problem is a real-world analogue to the reproducibility crisis in academic research. A researcher makes a potentially flawed yet groundbreaking discovery, but their documentation of their process is inadequate. Nobody is able to rediscover it, so are they lying or not? More importantly, how can we research further if the works that inspire us could be inherently flawed? \n\nLet me know if you have any advice, Mr. Alien. \n\nYour human friend,\\\nCaleb\n\n"}, {"category": "reflection", "path": "02072023.md", "date": "02/07/2023", "data": "# What is thinking?\nAccording to Delueze, math isn't thinking. It is pure synthesis from established axioms, while oil paintings, for example, require an artist to interpret the world around them through creativity. It seems that Delueze regards nearly every field in the sciences as devoid of thinking while every form of art requires thinking. \n\nBut, in my opinion, mathematics can be an art. Both Delueze and many of classmates perpetuate the false assumption that math is simply the application of formulas in various contexts, but to any competitive mathlete, it is clear that math is much more. For computational problems, yes, the work involves the application of established ideas, and the resulting mathematical argument is purely synthesis. However, such problems require the creativity and bravery to explore ideas that may fail, and to a greater extent, proof-based problems expose an even greater unknown. \n\nTake Monksy's Theorem. In the 20th century, Fred Richman proposed a problem that stumped mathematicians for decades: \"Can a square be split into an odd number of traingles with equal area?\" The question clearly involves geometry, and yet, Monksy's proof uses an advanced technique known as p-adic evaluations to relate points on the square to prime numbers. At the end of the day, yes, his argument is logically sound and falls directly from established axioms. But in order to come up with the solution, Monsky needed to interpret the problem beyond the lens of geometry, similar to how an abstract artist interprets their world beyond naive understanding. \n\nBut it is also important to realize that the same problem for multiple people may not involve thinking. Sometimes, I solve problems by identification, remembering a past, similar problem and formulaically applying the same approach. But to a newer mathlete, this same problem may require the person to pioneer their idea. \n\nSo what is thinking? It's anything that involves creativity or exploration, and yes, that includes parts of math. \n\n\n"}, {"category": "classwork", "path": "02022023.md", "date": "02/02/2023", "data": "# Assignment\nThis is some placeholder text for a classwork assignment.\n"}, {"category": "daily", "path": "02022023.md", "date": "02/02/2023", "data": "# Is that so?\nAt first, Hakuin seems devoid of emotion, responding \"Is that so?\" both to the accusation and request for forgiveness. Described as a Zen master, Hakuin clearly accepts the meaning of his life, unwilling to let random events perturb his outlook. But at what point does this blissful negligence become a blatant disregard for life? Shouldn't a person care about their future, even if it is out of their control?\n"}]}