{"categories": [{"name": "classwork", "files": [{"path": "02092023.md", "date": "02/09/2023", "data": "# Assignment\nWow another cool assignment from Mr. Field!\n"}, {"path": "02022023.md", "date": "02/02/2023", "data": "# Assignment\nThis is some placeholder text for a classwork assignment.\n"}]}, {"name": "daily", "files": [{"path": "03062023.md", "date": "03/06/2023", "data": "# Plato's Allegory of the Cave\n1: What is your reality?\n\nI am a Christian, a researcher, and developer. As a student of TJHSST, I am constantly immersed in a competitive academic atmosphere, and at church, I am continually exposed to radically conservative ideas, despite my agreement/disagreement with them. I have been taught to question, argue, and think for myself, but I place a great value on individual achievement. \n\n\\\n2: What would it take to be dragged and compelled out of the cave? \n\nIn order to fully exit this conservative upbringing, I would need to be completely immersed in a radically different atmosphere, whether that happen at college or in the workplace.\n\n"}, {"path": "02282023.md", "date": "02/28/2023", "data": "# Extremify?\nRegarding the reproducibility problem described in my previous entry:\n\nLet's consider an extreme solution. All work must be replicated before publication by more than three independent researchers. Tables and metrics must be exactly verified, and all implementation instructions or code must be provided by the paper. Besides the additional effort on the part of the journal to carry out this procedure, by the end, the reviewer has done nearly as much work as the primary investigator. Further, for large projects with multiple authors, it is nearly impossible to task one person on replicating the entire paper. While the solution solves the reproducibility crisis, the burden on the reviewer is too large to surmount. \n\nOn the other hand, let's consider an extreme version of the problem. What if the researcher directly made up information? Could this go undetected? At the moment, there is no such reproducibility verification, so hypothetically, a researcher could get away with making up entire tables of data. \n\nConsidering these extremes, it seems like the best overall solution is for journals to require code to be shared along with published work. This guarantees some amount of reproducibility as reviewers should be able to immediately run code and see results, but at the same time, it does not force all reviewers to spend exorbitant amounts of time for verification.\n\n"}, {"path": "02232023.md", "date": "02/23/2023", "data": "# Challenge: Be A Skeptic\nRegarding the reproducibility problem described in my previous entry:\n\nBut, how do we know that the reproducibility crisis even exists? Perhaps the real issue is that academic papers need a more thorough format. Before preemptively blaming academic dishonesty, maybe the stigma of verbose research writing dilutes the implementation details that are needed to increase reproducibility. \n\nHow is this a pertinent issue for the larger academic audience? If a journal wants to publish quality work, they are free to mandate peer-review or reproducibility rules. However, if no such rules are in place, why is it the responsibility of the researcher to produce reproducible work if that is not the requirement?\n\nOf course, as with any academic pursuit, dishonest people exist, but it is entirely inappropriate to call this matter a crisis, or even an issue.\n"}, {"path": "02092023.md", "date": "02/09/2023", "data": "# Explain It to An Alien\n**Problem:** How do we solve the reproducibility crisis in academic research, specifically in computer science?\n\nDear Alien,\n\nImagine you make a discovery. You find a rock. The rock is shiny, heavy, and glows in the dark. So what do you do? You tell your friends, of course. You tell them that you saw a rock. It was shiny, heavy, and glowed in the dark. Your friends ask to see the rock, and that's when you realize that you dropped it on your way to see them. Should you be trusted? How do your friends know that you never lied?\n\nThis problem is a real-world analogue to the reproducibility crisis in academic research. A researcher makes a potentially flawed yet groundbreaking discovery, but their documentation of their process is inadequate. Nobody is able to rediscover it, so are they lying or not? More importantly, how can we research further if the works that inspire us could be inherently flawed? \n\nLet me know if you have any advice, Mr. Alien. \n\nYour human friend,\\\nCaleb\n\n"}, {"path": "02022023.md", "date": "02/02/2023", "data": "# Is that so?\nAt first, Hakuin seems devoid of emotion, responding \"Is that so?\" both to the accusation and request for forgiveness. Described as a Zen master, Hakuin clearly accepts the meaning of his life, unwilling to let random events perturb his outlook. But at what point does this blissful negligence become a blatant disregard for life? Shouldn't a person care about their future, even if it is out of their control?\n"}]}, {"name": "reflection", "files": [{"path": "02092023.md", "date": "02/09/2023", "data": "# Reflection\nWow another cool reflection from Mr. Field!\n"}, {"path": "02022023.md", "date": "02/02/2023", "data": "# Reflection\nThis is some placeholder text for a classwork reflection.\n"}]}]}